[
  {
	"id": 1,
	"text": "Majestade, o povo aguarda um plano detalhado de reconstrução com cada passo nos próximos anos. Como devemos proceder?",
	"left_choice": "Adote ciclos curtos e entregas frequentes. Vamos nos adaptar conforme avançamos.",
	"right_choice": "Crie um plano completo e rígido. Precisamos prever tudo desde o início.",
	"image": "Sir Cedric",
	"left_effects": { "moral": 10, "resources": -2, "time": 5, "trust": 10, "progress": 10 },
	"right_effects": { "moral": -20, "resources": -2, "time": -15, "trust": -20, "progress": -15 },
	"correct_answer": "left",
	"feedback": {
	  "left": "Flexibilidade é essencial, majestade. Em tempos de incerteza, adaptabilidade é mais valiosa que previsões. (Sir Cedric)",
	  "right": "Planos imutáveis são frágeis diante do caos. O reino precisa de ritmo, não rigidez. (Sir Cedric)"
	}
  },
  {
	"id": 2,
	"text": "Sir Cedric sugere que, antes de cada ciclo de trabalho, a equipe se reúna para planejar em conjunto. Concorda?",
	"left_choice": "Sim, todos devem entender os objetivos e colaborar nas decisões.",
	"right_choice": "Não, só os líderes precisam saber. Os demais devem apenas executar.",
	"image": "Sir Cedric",
	"left_effects": { "moral": 10, "resources": 0, "time": 5, "trust": 10, "progress": 10 },
	"right_effects": { "moral": -20, "resources": 0, "time": -10, "trust": -20, "progress": -10 },
	"correct_answer": "left",
	"feedback": {
	  "left": "Excelente, Sire! Planejamentos colaborativos aumentam engajamento e reduzem erros. (Sir Cedric)",
	  "right": "Ordens cegas não constroem equipes fortes. Liderança exige escuta e alinhamento. (Sir Cedric)"
	}
  },
  {
	"id": 3,
	"text": "Os trabalhadores estão desmotivados. Dizem não entender por que cada tarefa muda tanto.",
	"left_choice": "Explique que estamos aprendendo e ajustando conforme o reino evolui.",
	"right_choice": "Ignore. Eles devem apenas cumprir ordens.",
	"image": "Lady Elara",
	"left_effects": { "moral": 15, "resources": 0, "time": 2, "trust": 10, "progress": 5 },
	"right_effects": { "moral": -25, "resources": 0, "time": -10, "trust": -15, "progress": -10 },
	"correct_answer": "left",
	"feedback": {
	  "left": "Transparência constrói confiança. Adaptar-se não é fraqueza, é inteligência. (Lady Elara)",
	  "right": "Trabalhar no escuro mina a motivação. O povo precisa de propósito, não apenas tarefas. (Lady Elara)"
	}
  },
  {
	"id": 4,
	"text": "A Guilda dos Anões quer começar logo a reconstrução, mesmo sem todos os requisitos definidos.",
	"left_choice": "Apoie. Podemos iniciar com o que temos e ajustar conforme avançamos.",
	"right_choice": "Espere tudo estar claro. Não devemos correr riscos.",
	"image": "Anoes",
	"left_effects": { "moral": 10, "resources": 0, "time": 5, "trust": 10, "progress": 10 },
	"right_effects": { "moral": -15, "resources": 0, "time": -10, "trust": -15, "progress": -10 },
	"correct_answer": "left",
	"feedback": {
	  "left": "Trabalhar com entregas incrementais nos permite avançar com segurança. (Guilda dos Anões)",
	  "right": "Esperar demais pode paralisar o progresso e desmotivar os construtores. (Guilda dos Anões)"
	}
  },
  {
	"id": 5,
	"text": "A Rainha Stakeholdina exige uma previsão exata de quando o castelo estará pronto.",
	"left_choice": "Explique que faremos entregas por ciclos curtos e ajustaremos conforme aprendermos.",
	"right_choice": "Dê uma data exata, mesmo sem certeza. Isso a deixará mais calma.",
	"image": "Rainha Stakeholdina",
	"left_effects": { "moral": 5, "resources": 0, "time": 5, "trust": 10, "progress": 5 },
	"right_effects": { "moral": -15, "resources": 0, "time": -15, "trust": -20, "progress": -10 },
	"correct_answer": "left",
	"feedback": {
	  "left": "Promessas realistas baseadas em ciclos geram mais confiança a longo prazo. (Rainha Stakeholdina)",
	  "right": "Prometer o impossível só trará decepções e desconfiança. (Rainha Stakeholdina)"
	}
  },
  {
	"id": 6,
	"text": "Sir Cedric propõe que façamos uma breve retrospectiva ao final desta primeira fase.",
	"left_choice": "Apoie a ideia. Refletir sobre o que funcionou ou não pode ajudar muito.",
	"right_choice": "Não. Isso é perda de tempo. Precisamos continuar produzindo.",
	"image": "Sir Cedric",
	"left_effects": { "moral": 10, "resources": 0, "time": -2, "trust": 10, "progress": 5 },
	"right_effects": { "moral": -15, "resources": 0, "time": 5, "trust": -15, "progress": -10 },
	"correct_answer": "left",
	"feedback": {
	  "left": "Aprender com a experiência fortalece as próximas decisões. (Sir Cedric)",
	  "right": "Ignorar lições nos condena a repetir erros. (Sir Cedric)"
	}
  },
  {
	"id": 7,
	"text": "Lady Elara quer priorizar a reconstrução do portão, pois é o que mais preocupa o povo.",
	"left_choice": "Apoie a decisão. Entregar valor para o povo é prioridade.",
	"right_choice": "Negue. Seguiremos o plano original, sem mudanças.",
	"image": "Lady Elara",
	"left_effects": { "moral": 10, "resources": -2, "time": -2, "trust": 10, "progress": 10 },
	"right_effects": { "moral": -15, "resources": 0, "time": 0, "trust": -15, "progress": -10 },
	"correct_answer": "left",
	"feedback": {
	  "left": "Priorizar com base no valor entregue é essencial para reconstruir com impacto. (Lady Elara)",
	  "right": "Insistir em planos engessados afasta o time das necessidades reais. (Lady Elara)"
	}
  },
  {
	"id": 8,
	"text": "A Guilda dos Anões sugere que definam suas próprias tarefas ao invés de receber ordens diretas.",
	"left_choice": "Apoie a auto-organização. Eles sabem como trabalhar melhor.",
	"right_choice": "Negue. Um líder deve dar todas as ordens.",
	"image": "Anoes",
	"left_effects": { "moral": 10, "resources": 0, "time": 5, "trust": 10, "progress": 10 },
	"right_effects": { "moral": -15, "resources": 0, "time": -10, "trust": -15, "progress": -10 },
	"correct_answer": "left",
	"feedback": {
	  "left": "Equipes auto-organizadas são mais ágeis e comprometidas com o sucesso. (Guilda dos Anões)",
	  "right": "Centralizar tudo sobrecarrega a liderança e desmotiva a equipe. (Guilda dos Anões)"
	}
  },
  {
	"id": 9,
	"text": "A Rainha Stakeholdina enviou uma lista de exigências longas e detalhadas. Como devemos lidar?",
	"left_choice": "Alinhe expectativas com ela e mostre como vamos priorizar valor aos poucos.",
	"right_choice": "Aceite tudo sem discutir. É melhor evitar conflito.",
	"image": "Rainha Stakeholdina",
	"left_effects": { "moral": 10, "resources": 0, "time": 5, "trust": 10, "progress": 5 },
	"right_effects": { "moral": -20, "resources": 0, "time": -10, "trust": -20, "progress": -10 },
	"correct_answer": "left",
	"feedback": {
	  "left": "Alinhamento com stakeholders é essencial para evitar desperdícios. (Rainha Stakeholdina)",
	  "right": "Aceitar tudo sem planejamento gera caos e sobrecarga. (Rainha Stakeholdina)"
	}
  },
  {
	"id": 10,
	"text": "Sir Cedric questiona se devemos manter documentação mínima durante a reconstrução.",
	"left_choice": "Sim, apenas o necessário para que todos entendam e colaborem.",
	"right_choice": "Não. Devemos documentar tudo em detalhes extensos.",
	"image": "Sir Cedric",
	"left_effects": { "moral": 10, "resources": 0, "time": 5, "trust": 10, "progress": 5 },
	"right_effects": { "moral": -20, "resources": -5, "time": -15, "trust": -10, "progress": -10 },
	"correct_answer": "left",
	"feedback": {
	  "left": "Documentação leve e útil favorece a comunicação sem atrasar entregas. (Sir Cedric)",
	  "right": "Excesso de burocracia retarda o progresso e desvia o foco. (Sir Cedric)"
	}
  }
]
